text = 'бкоезгенпаеейнмгнииеоежзкгаздежг'
alf = [['а', '0000'], ['б', '0001'], ['в', '0010'], ['г', '0011'], ['д', '0100'], ['е', '0101'], ['ж', '0110'], ['з', '0111'], ['и', '1000'], ['й', '1001'], ['к', '1010'], ['л', '1011'], ['м', '1100'], ['н', '1101'], ['о', '1110'], ['п', '1111']]
textBloks = [text[0:16], text[16: 32]]
shifr = ['', '']

for i in range(16):
    for j in range(16):
        if textBloks[0][i] == alf[j][0]:
            shifr[0] = shifr[0] + alf[j][1] + ' '

for i in range(16):
    for j in range(16):
        if textBloks[1][i] == alf[j][0]:
            shifr[1] = shifr[1] + alf[j][1] + ' '

print('Сообщение: ', text, '\n', 'Сообщение, разделенное на блоки по 64 бита: ', textBloks, '\n', 'Значения блоков в двоичном коде: ', shifr)